app/views/welcome/index.html.erb

  <h1>Latest article</h1>
    <% latest_article = Article.last %>
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1  [["LIMIT", 3]]

    <%= image_tag "ace.jpeg" %>
    <p>Comments: <%= latest_article.comments.count%></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]