app/views/events/index.html.erb

SELECT "participants".* FROM "participants" WHERE "participants"."event_id" = ?  [["event_id", 1]]
---
      <td><%= event.budget %></td>
      <% if event.participants.any?  %>