app/controllers/events_controller.rb

INSERT INTO "events" ("date", "location", "budget", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "1990-08-01"], ["location", "Paris"], ["budget", "200"], ["created_at", "2019-09-24 06:01:49.827774"], ["updated_at", "2019-09-24 06:01:49.827774"]]
INSERT INTO "participants" ("created_at", "updated_at", "event_id") VALUES (?, ?, ?)  [["created_at", "2019-09-24 06:01:49.835202"], ["updated_at", "2019-09-24 06:01:49.835202"], ["event_id", 1]]
---
  def create
    @event = Event.new(event_params)
    _participants = @event.add_participant(params["email"].split( /, */ ))
    @event.user = current_user
      if @event.save!