app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)
      if @topic.save
---
INSERT INTO "topics" ("title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Salut"], ["message", "Lorem"], ["created_at", "2019-09-23 20:44:55.680064"], ["updated_at", "2019-09-23 20:44:55.680064"]]